; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v1 - type_3 ?v5 - type_2)
 	      (pred_4 ?v4 - object ?v5 - type_2)
	      (pred_1 ?v1 - type_3 ?v8 - type_1)
	      (pred_3 ?v1 - type_3 ?v4 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v1 - type_3 ?v3 ?v2 - type_2)
       :precondition (and  (pred_2 ?v1 ?v3))
       :effect (and  (pred_2 ?v1 ?v2)
		     (not (pred_2 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_3 ?v6 - object ?v7 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v7) (pred_2 ?v1 ?v7) (pred_1 ?v1 ?v8))
       :effect (and (pred_3 ?v1 ?v6 ?v8)
		    (not (pred_4 ?v6 ?v7)) 
		    (not (pred_1 ?v1 ?v8))))

   (:action op_2
       :parameters (?v1 - type_3 ?v6 - object ?v7 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v6 ?v8) (pred_2 ?v1 ?v7))
       :effect (and (pred_4 ?v6 ?v7)
		    (pred_1 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_08 - type_3
obj_12 obj_03 obj_01 obj_13 - type_1
obj_09 obj_06 obj_05 obj_11 - type_2
obj_07 obj_02 obj_04 - object)
(:init
(pred_2 obj_10 obj_09)
(pred_1 obj_10 obj_12)
(pred_1 obj_10 obj_03)
(pred_2 obj_08 obj_11)
(pred_1 obj_08 obj_01)
(pred_1 obj_08 obj_13)
(pred_4 obj_07 obj_06)
(pred_4 obj_02 obj_05)
(pred_4 obj_04 obj_11)
)
(:goal
(and
(pred_4 obj_07 obj_05)
(pred_4 obj_02 obj_11)
(pred_4 obj_04 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_10 obj_05) (pred_2 obj_08 obj_05))))
    (always (not (and (pred_2 obj_10 obj_11) (pred_2 obj_08 obj_11))))
  )
)
)

; plan
1. (op_1 obj_08 obj_04 obj_11 obj_13)
   deleted: (pred_4 obj_04 obj_11) (pred_1 obj_08 obj_13)
   added: (pred_3 obj_08 obj_04 obj_13)
   goals met: 0 of 3
2. (op_3 obj_10 obj_09 obj_05)
   deleted: (pred_2 obj_10 obj_09)
   added: (pred_2 obj_10 obj_05)
   goals met: 0 of 3
3. (op_3 obj_08 obj_11 obj_06)
   deleted: (pred_2 obj_08 obj_11)
   added: (pred_2 obj_08 obj_06)
   goals met: 0 of 3
4. (op_1 obj_10 obj_02 obj_05 obj_03)
   deleted: (pred_4 obj_02 obj_05) (pred_1 obj_10 obj_03)
   added: (pred_3 obj_10 obj_02 obj_03)
   goals met: 0 of 3
5. (op_3 obj_10 obj_05 obj_11)
   deleted: (pred_2 obj_10 obj_05)
   added: (pred_2 obj_10 obj_11)
   goals met: 0 of 3
6. (op_2 obj_08 obj_04 obj_06 obj_13)
   deleted: (pred_3 obj_08 obj_04 obj_13)
   added: (pred_4 obj_04 obj_06) (pred_1 obj_08 obj_13)
   goals met: 1 of 3
7. (op_1 obj_08 obj_07 obj_06 obj_01)
   deleted: (pred_4 obj_07 obj_06) (pred_1 obj_08 obj_01)
   added: (pred_3 obj_08 obj_07 obj_01)
   goals met: 1 of 3
8. (op_3 obj_08 obj_06 obj_05)
   deleted: (pred_2 obj_08 obj_06)
   added: (pred_2 obj_08 obj_05)
   goals met: 1 of 3
9. (op_2 obj_10 obj_02 obj_11 obj_03)
   deleted: (pred_3 obj_10 obj_02 obj_03)
   added: (pred_4 obj_02 obj_11) (pred_1 obj_10 obj_03)
   goals met: 2 of 3
10. (op_2 obj_08 obj_07 obj_05 obj_01)
   deleted: (pred_3 obj_08 obj_07 obj_01)
   added: (pred_4 obj_07 obj_05) (pred_1 obj_08 obj_01)
   goals met: 3 of 3
